p2p-bench/results/2026-06-16_5060ti-16gb_2cards_gen3-x4_p2p-sweep-c1-2-4-8/scenarios/p2p_off-c8/run_3.stdout.txt
WARNING 06-16 22:26:57 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ccb9894f7e0>, trust_remote_code=False, seed=1234, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8081', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='p2p_off-c8', input_len=None, output_len=None, tokenizer='/data/models/qwen3.6-27b-text-nvfp4-mtp', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run1/scenarios/p2p_off-c8', result_filename='run_3.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-24a973a6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-16 22:27:02 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  780.20    
Total input tokens:                      131072    
Total generated tokens:                  131072    
Request throughput (req/s):              0.16      
Output token throughput (tok/s):         168.00    
Peak output token throughput (tok/s):    75.00     
Peak concurrent requests:                10.00     
Total token throughput (tok/s):          336.00    
---------------Time to First Token----------------
Mean TTFT (ms):                          18768.43  
Median TTFT (ms):                        19229.65  
P50 TTFT (ms):                           19229.65  
P90 TTFT (ms):                           26669.34  
P99 TTFT (ms):                           31913.40  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.36     
Median TPOT (ms):                        26.78     
P50 TPOT (ms):                           26.78     
P90 TPOT (ms):                           33.03     
P99 TPOT (ms):                           73.03     
---------------Inter-token Latency----------------
Mean ITL (ms):                           79.69     
Median ITL (ms):                         70.73     
P50 ITL (ms):                            70.73     
P90 ITL (ms):                            71.10     
P99 ITL (ms):                            935.21    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          47781.25  
Median E2EL (ms):                        46214.57  
P50 E2EL (ms):                           46214.57  
P90 E2EL (ms):                           57659.97  
P99 E2EL (ms):                           90761.66  
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:22<02:40, 22.89s/it]
 25%|██▌       | 2/8 [00:25<01:04, 10.73s/it]
 50%|█████     | 4/8 [00:27<00:19,  4.84s/it]
 62%|██████▎   | 5/8 [00:31<00:13,  4.55s/it]
 75%|███████▌  | 6/8 [00:43<00:13,  6.74s/it]
 88%|████████▊ | 7/8 [00:43<00:04,  4.82s/it]
100%|██████████| 8/8 [01:08<00:00, 10.87s/it]
100%|██████████| 8/8 [01:08<00:00,  8.58s/it]

  0%|          | 0/128 [00:00<?, ?it/s]
  1%|          | 1/128 [00:22<48:23, 22.86s/it]
  2%|▏         | 2/128 [00:24<21:27, 10.22s/it]
  2%|▏         | 3/128 [00:31<18:03,  8.66s/it]
  3%|▎         | 4/128 [00:40<18:17,  8.85s/it]
  4%|▍         | 5/128 [00:45<15:26,  7.53s/it]
  5%|▍         | 6/128 [00:50<13:23,  6.59s/it]
  5%|▌         | 7/128 [00:56<13:17,  6.59s/it]
  6%|▋         | 8/128 [01:09<17:09,  8.58s/it]
  7%|▋         | 9/128 [01:15<15:33,  7.85s/it]
  8%|▊         | 10/128 [01:17<11:50,  6.02s/it]
  9%|▊         | 11/128 [01:20<09:45,  5.00s/it]
  9%|▉         | 12/128 [01:26<10:10,  5.26s/it]
 10%|█         | 13/128 [01:34<12:02,  6.28s/it]
 11%|█         | 14/128 [01:40<11:21,  5.98s/it]
 12%|█▏        | 15/128 [01:44<10:08,  5.39s/it]
 12%|█▎        | 16/128 [01:50<10:25,  5.58s/it]
 13%|█▎        | 17/128 [01:51<08:04,  4.37s/it]
 14%|█▍        | 18/128 [01:57<08:54,  4.86s/it]
 15%|█▍        | 19/128 [02:08<12:07,  6.68s/it]
 16%|█▌        | 20/128 [02:16<12:40,  7.04s/it]
 16%|█▋        | 21/128 [02:22<12:05,  6.78s/it]
 17%|█▋        | 22/128 [02:24<09:09,  5.18s/it]
 18%|█▊        | 23/128 [02:28<08:25,  4.81s/it]
 19%|█▉        | 24/128 [02:35<09:32,  5.51s/it]
 20%|█▉        | 25/128 [02:41<09:45,  5.68s/it]
 20%|██        | 26/128 [02:46<09:19,  5.49s/it]
 21%|██        | 27/128 [02:53<10:11,  6.05s/it]
 22%|██▏       | 28/128 [02:55<07:57,  4.77s/it]
 23%|██▎       | 29/128 [03:03<09:37,  5.83s/it]
 23%|██▎       | 30/128 [03:08<08:51,  5.42s/it]
 24%|██▍       | 31/128 [03:10<07:04,  4.37s/it]
 25%|██▌       | 32/128 [03:24<11:39,  7.29s/it]
 27%|██▋       | 34/128 [03:28<07:47,  4.97s/it]
 27%|██▋       | 35/128 [03:35<08:15,  5.33s/it]
 28%|██▊       | 36/128 [03:46<10:29,  6.84s/it]
 29%|██▉       | 37/128 [03:50<09:04,  5.99s/it]
 30%|██▉       | 38/128 [03:52<07:31,  5.02s/it]
 30%|███       | 39/128 [04:05<10:51,  7.32s/it]
 31%|███▏      | 40/128 [04:15<11:35,  7.90s/it]
 32%|███▏      | 41/128 [04:20<10:19,  7.12s/it]
 33%|███▎      | 42/128 [04:23<08:23,  5.86s/it]
 34%|███▎      | 43/128 [04:26<07:09,  5.05s/it]
 34%|███▍      | 44/128 [04:39<10:19,  7.37s/it]
 35%|███▌      | 45/128 [04:48<10:56,  7.90s/it]
 37%|███▋      | 47/128 [04:50<06:25,  4.76s/it]
 38%|███▊      | 48/128 [04:53<05:45,  4.32s/it]
 38%|███▊      | 49/128 [05:06<08:48,  6.68s/it]
 39%|███▉      | 50/128 [05:16<09:37,  7.41s/it]
 40%|███▉      | 51/128 [05:19<08:01,  6.25s/it]
 41%|████      | 52/128 [05:20<06:09,  4.86s/it]
 41%|████▏     | 53/128 [05:25<06:07,  4.90s/it]
 42%|████▏     | 54/128 [05:31<06:25,  5.20s/it]
 43%|████▎     | 55/128 [05:40<07:47,  6.40s/it]
 44%|████▍     | 56/128 [05:43<06:20,  5.29s/it]
 45%|████▍     | 57/128 [05:49<06:24,  5.42s/it]
 45%|████▌     | 58/128 [05:53<05:44,  4.93s/it]
 46%|████▌     | 59/128 [05:54<04:24,  3.84s/it]
 47%|████▋     | 60/128 [06:06<07:12,  6.35s/it]
 48%|████▊     | 61/128 [06:11<06:31,  5.85s/it]
 48%|████▊     | 62/128 [06:12<04:50,  4.40s/it]
 49%|████▉     | 63/128 [06:21<06:15,  5.78s/it]
 50%|█████     | 64/128 [06:23<05:01,  4.71s/it]
 51%|█████     | 65/128 [06:32<06:21,  6.06s/it]
 52%|█████▏    | 66/128 [06:40<06:42,  6.50s/it]
 52%|█████▏    | 67/128 [06:43<05:34,  5.49s/it]
 53%|█████▎    | 68/128 [06:48<05:17,  5.29s/it]
 54%|█████▍    | 69/128 [06:54<05:27,  5.56s/it]
 55%|█████▍    | 70/128 [07:02<06:13,  6.44s/it]
 55%|█████▌    | 71/128 [07:07<05:38,  5.93s/it]
 56%|█████▋    | 72/128 [07:12<05:13,  5.60s/it]
 57%|█████▋    | 73/128 [07:23<06:37,  7.23s/it]
 58%|█████▊    | 74/128 [07:28<06:00,  6.68s/it]
 59%|█████▊    | 75/128 [07:34<05:32,  6.28s/it]
 59%|█████▉    | 76/128 [07:36<04:17,  4.95s/it]
 60%|██████    | 77/128 [07:54<07:32,  8.88s/it]
 61%|██████    | 78/128 [07:58<06:16,  7.54s/it]
 62%|██████▏   | 79/128 [08:01<05:05,  6.24s/it]
 62%|██████▎   | 80/128 [08:03<03:55,  4.90s/it]
 63%|██████▎   | 81/128 [08:06<03:25,  4.37s/it]
 64%|██████▍   | 82/128 [08:30<07:45, 10.12s/it]
 65%|██████▍   | 83/128 [08:33<06:00,  8.00s/it]
 66%|██████▋   | 85/128 [08:35<03:31,  4.92s/it]
 67%|██████▋   | 86/128 [08:54<05:44,  8.21s/it]
 68%|██████▊   | 87/128 [08:55<04:24,  6.44s/it]
 69%|██████▉   | 88/128 [09:01<04:13,  6.34s/it]
 70%|██████▉   | 89/128 [09:13<05:12,  8.01s/it]
 70%|███████   | 90/128 [09:16<04:06,  6.47s/it]
 71%|███████   | 91/128 [09:17<03:05,  5.01s/it]
 72%|███████▏  | 92/128 [09:19<02:23,  3.98s/it]
 73%|███████▎  | 93/128 [09:24<02:30,  4.31s/it]
 73%|███████▎  | 94/128 [09:38<04:05,  7.21s/it]
 74%|███████▍  | 95/128 [09:41<03:10,  5.77s/it]
 75%|███████▌  | 96/128 [09:48<03:21,  6.29s/it]
 76%|███████▌  | 97/128 [09:49<02:27,  4.75s/it]
 77%|███████▋  | 98/128 [09:54<02:24,  4.82s/it]
 77%|███████▋  | 99/128 [10:04<03:00,  6.23s/it]
 78%|███████▊  | 100/128 [10:10<02:57,  6.34s/it]
 79%|███████▉  | 101/128 [10:11<02:07,  4.74s/it]
 80%|███████▉  | 102/128 [10:24<03:03,  7.07s/it]
 80%|████████  | 103/128 [10:29<02:42,  6.48s/it]
 81%|████████▏ | 104/128 [10:36<02:39,  6.65s/it]
 82%|████████▏ | 105/128 [10:37<01:55,  5.02s/it]
 83%|████████▎ | 106/128 [10:42<01:50,  5.04s/it]
 84%|████████▎ | 107/128 [10:48<01:50,  5.25s/it]
 84%|████████▍ | 108/128 [11:07<03:09,  9.47s/it]
 85%|████████▌ | 109/128 [11:10<02:21,  7.46s/it]
 86%|████████▌ | 110/128 [11:19<02:23,  7.99s/it]
 87%|████████▋ | 111/128 [11:35<02:53, 10.21s/it]
 88%|████████▊ | 112/128 [11:38<02:08,  8.00s/it]
 88%|████████▊ | 113/128 [11:40<01:35,  6.35s/it]
 89%|████████▉ | 114/128 [11:45<01:25,  6.07s/it]
 90%|████████▉ | 115/128 [11:59<01:46,  8.21s/it]
 91%|█████████ | 116/128 [12:01<01:18,  6.55s/it]
 91%|█████████▏| 117/128 [12:02<00:54,  4.91s/it]
 92%|█████████▏| 118/128 [12:08<00:51,  5.18s/it]
 93%|█████████▎| 119/128 [12:16<00:53,  5.95s/it]
 94%|█████████▍| 120/128 [12:23<00:49,  6.14s/it]
 95%|█████████▍| 121/128 [12:29<00:44,  6.37s/it]
 95%|█████████▌| 122/128 [12:31<00:29,  4.93s/it]
 96%|█████████▌| 123/128 [12:37<00:26,  5.26s/it]
 97%|█████████▋| 124/128 [12:41<00:18,  4.72s/it]
 98%|█████████▊| 125/128 [12:50<00:18,  6.19s/it]
 98%|█████████▊| 126/128 [12:51<00:09,  4.51s/it]
 99%|█████████▉| 127/128 [12:54<00:04,  4.23s/it]
100%|██████████| 128/128 [13:00<00:00,  4.57s/it]
100%|██████████| 128/128 [13:00<00:00,  6.10s/it]